# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [11]:
c.execute('''select firstName, lastName, city, state 
                                    from employees
                                    join offices
                                    using(officeCode)
                                    order by firstName, lastName''')
df = pd.DataFrame(c.fetchall())
df.columns=[x[0] for x in c.description]
df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [14]:
c.execute('''select contactFirstName, contactLastName, 
                                orderDate, status
                                from customers
                                join orders
                                using(customerNumber)''')
df = pd.DataFrame(c.fetchall())
df.columns=[x[0] for x in c.description]
print(len(df))
df.head()

326

  contactFirstName contactLastName   orderDate   status
0          Carine          Schmitt  2003-05-20  Shipped
1          Carine          Schmitt  2004-09-27  Shipped
2          Carine          Schmitt  2004-11-25  Shipped
3             Jean            King  2003-05-21  Shipped
4             Jean            King  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [15]:
c.execute('''select contactFirstName, contactLastName,
                                amount, paymentDate
                                from customers
                                join payments
                                using(customerNumber)''')
df = pd.DataFrame(c.fetchall())
df.columns=[x[0] for x in c.description]
print(len(df))
df.head()

273

  contactFirstName contactLastName    amount paymentDate
0          Carine          Schmitt  14571.44  2003-06-05
1          Carine          Schmitt   6066.78  2004-10-19
2          Carine          Schmitt   1676.14  2004-12-18
3             Jean            King  32641.98  2003-06-06
4             Jean            King  33347.88  2004-08-20

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [17]:
c.execute('''select contactFirstName, contactLastName, 
                            productName, 
                            quantityOrdered,
                            orderDate
                            from customers
                            join orders using(customerNumber)
                            join orderdetails using(orderNumber)
                            join products using(productCode)
                            order by orderDate''')
df = pd.DataFrame(c.fetchall())
df.columns=[x[0] for x in c.description]
print(len(df))
df.head()

2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Dorothy,Young,1917 Grand Touring Sedan,30,2003-01-06
1,Dorothy,Young,1911 Ford Town Car,50,2003-01-06
2,Dorothy,Young,1932 Alfa Romeo 8C2300 Spider Sport,22,2003-01-06
3,Dorothy,Young,1936 Mercedes Benz 500k Roadster,49,2003-01-06
4,Roland,Keitel,1932 Model A Ford J-Coupe,25,2003-01-09

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!